---
type: LinkedResourceOpenedEventArgs
namespace: Autodesk.Revit.DB.Events
version: 2024
members: 3
tags: [revit-api, class]
---

# LinkedResourceOpenedEventArgs

`Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | LinkedResourcePathName | 2018 | `public string LinkedResourcePathName { get ; }` |
| Property | ResourceType | 2018 | `public ExternalResourceType ResourceType { get ; }` |
| Property | ResourceTypeId | 2018 | `public ElementId ResourceTypeId { get ; }` |